// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "刘先生",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "我亲爱的哥哥",  // 同上...
        "今天是你的30岁生日",
        "这是我们在一起的",
        "第一个生日呢",
        "今天工作辛苦啦~",
        "很遗憾没有当面祝福",
        "但还是祝你生日快乐！平安顺遂！",
        "30岁，并不意味着青春的结束",
        "而是一个新阶段的开始",
        "希望哥哥获得真正的自由",
        "可以做自己喜欢的事情",
        "不要给自己太大压力",
        "欧巴你已经很优秀了",
        "已经成长为能披荆斩棘的大英雄了",
        "所以在我面前",
        "做一个被人疼爱的小朋友叭",
        "当然!我也是小朋友~",
        "所以你不能欺负我~",
        "Honey",
        "感谢我们不早不晚刚好相遇",
        "山海有你不惧千里",
        "请你好好爱生活，爱自己",
        "我也会努力",
        "mua~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
